Revit 2027 API
ViewTemplateApplicationOption Enumeration
 Options for applying view templates
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewTemplateApplicationOption
Public Enumeration ViewTemplateApplicationOption
public enum class ViewTemplateApplicationOption
type ViewTemplateApplicationOption
Members
Member name | Value | Description
AllParameters | 0 |  Apply all parameters controlled by template
AllParametersAndStickIfNone | 2 |  Apply all parameters controlled by template and if none is currently assigned make it view template
UncontrolledParameters | 1 |  Apply only parameters controlled by template and not controlled by currently assigned view template
See Also
Reference
Autodesk.Revit.DB Namespace